Enums/ВидыПросмотраСпискаОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыПросмотраСпискаОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Списком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПапкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКатегориям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВидамДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВопросамДеятельности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКонтрагентам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНоменклатуреДел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДеламТомам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПроектам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПользователям</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВходящиеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ВходящиеДокументы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ИсходящиеДокументы</xr:Item>
				<xr:Item>Catalog.Файлы</xr:Item>
				<xr:Item>Document.ВходящееПисьмо</xr:Item>
				<xr:Item>Document.ИсходящееПисьмо</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адресат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВходящихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбращения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбращенийГраждан</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВопросДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрифДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрифыДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дело</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДелаХраненияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дубликат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьАвтоматическоеДобавлениеУчастниковРабочейГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зарегистрировал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЛистов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПриложений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЭкземпляров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоПереадресовавшего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛистовВПриложениях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураДел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураДел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Переадресовавший</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Повторное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение адресата</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РегистрационныйНомер</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Создал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПолучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Comment>Плановый срок исполнения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОтветаПереадресовавшему</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗапретитьАвтоматическоеДобавлениеУчастниковРабочейГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьШаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныВходящихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяОтветПереадресовавшему</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧисловойНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныВходящихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьРезолюции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АвторРезолюции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРезолюции</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Резолюция</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рассмотрение</Name>
							<Type>
								<v8:Type>cfg:BusinessProcessRef.Рассмотрение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СубъектыПерсональныхДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьЭлектронныеЦифровыеПодписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПодписи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаПодписи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>260</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомуВыданСертификат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отпечаток</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подпись</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстановившийПодпись</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сертификат</Name>
							<Comment>Двоичные данные сертификата</Comment>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РаботаСоСпискамиДокументов/Ext/Module.bsl
// Переключает вид просмотра в списках документов.
//
// Параметры:
//   Форма - УправляемаяФорма - форма, в которой расположен список.
//
Процедура ПереключитьВидПросмотра(Форма) Экспорт 
	
	Элементы = Форма.Элементы;
	Список = Форма.Список;
	ВидПросмотра = Форма.ВидПросмотра;
	ПредыдущийВидПросмотра = Форма.ПредыдущийВидПросмотра;
	
	РаботаСКатегориямиДанныхКлиентСервер.ОтключитьКатегорииКакПараметры(Список, 10);
	
	ПараметрыКомпоновки = Новый Структура(
		"Папка, 
		|ВидДокумента, 
		|ВопросДеятельности, 
		|Контрагент, 
		|Проект, 
		|НоменклатураДел, 
		|Дело");
		
	Для Каждого ИмяПараметра Из ПараметрыКомпоновки Цикл
		Параметр = Список.Параметры.НайтиЗначениеПараметра(
			Новый ПараметрКомпоновкиДанных(ИмяПараметра.Ключ));
		Если Параметр <> Неопределено И Параметр.Использование Тогда 
			Параметр.Использование = Ложь;
		КонецЕсли;	
	КонецЦикла;
	
	Если Элементы.Найти("Папка") <> Неопределено Тогда 
		Элементы.Папка.Видимость = Истина;
	КонецЕсли;	
	
	Если Элементы.Найти("СтраницаПапки") <> Неопределено Тогда 	
		Элементы.СтраницаПапки.Видимость = Ложь;
	КонецЕсли;
	
	Если Элементы.Найти("СтраницаПапки") <> Неопределено Тогда 	
		Элементы.ОтборПапка.Видимость = Истина;
	КонецЕсли;	
	
	Если Элементы.Найти("РежимПросмотраПоПапкам") <> Неопределено Тогда 
		Элементы.РежимПросмотраПоПапкам.Пометка = Ложь;
	КонецЕсли;	
	
	Если Элементы.Найти("Контрагент") <> Неопределено Тогда 
		Элементы.Контрагент.Видимость = Истина;
	ИначеЕсли Элементы.Найти("Отправитель") <> Неопределено Тогда 
		Элементы.Отправитель.Видимость = Истина;
	ИначеЕсли Элементы.Найти("Получатели") <> Неопределено Тогда 
		Элементы.Получатели.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ВидДокумента.Видимость = Истина;
	Элементы.ВопросДеятельности.Видимость = Истина;
	Элементы.НоменклатураДел.Видимость = Истина;
	Элементы.Дело.Видимость = Истина;
	Элементы.ЕстьКатегории.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьКатегорииДанных");
	Элементы.Проект.Видимость = Истина;
	
	Элементы.СтраницыДеревоРазрезов.Видимость = Истина;
	Элементы.СтраницаВидыДокументов.Видимость = Ложь;
	Элементы.СтраницаВопросыДеятельности.Видимость = Ложь;
	Элементы.СтраницаКонтрагенты.Видимость = Ложь;
	Элементы.СтраницаНоменклатураДел.Видимость = Ложь;
	Элементы.СтраницаДелаТома.Видимость = Ложь;
	Элементы.СтраницаПроекты.Видимость = Ложь;
	Элементы.СтраницаКатегории.Видимость = Ложь;
	
	Если Элементы.Найти("ОтборВидДокумента") <> Неопределено Тогда 
		Элементы.ОтборВидДокумента.Видимость = Истина;
	КонецЕсли;
	Элементы.ОтборКонтрагент.Видимость = Истина;
	Если Элементы.Найти("ОтборПроект") <> Неопределено Тогда 
		Элементы.ОтборПроект.Видимость = Истина;
	КонецЕсли;
	Элементы.ОтборКатегория.Видимость = Истина;
	
	Элементы.РежимПросмотраСписком.Пометка = Ложь;
	Элементы.РежимПросмотраПоВидамДокументов.Пометка = Ложь;
	Элементы.РежимПросмотраПоВопросамДеятельности.Пометка = Ложь;
	Элементы.РежимПросмотраПоКонтрагентам.Пометка = Ложь;
	Элементы.РежимПросмотраПоНоменклатуреДел.Пометка = Ложь;
	Элементы.РежимПросмотраПоДеламТомам.Пометка = Ложь;
	Элементы.РежимПросмотраПоКатегориям.Пометка = Ложь;
	Элементы.РежимПросмотраПоПроектам.Пометка = Ложь;
	
	Если Элементы.Найти("СписокКонтекстноеМенюРежимПросмотраСписком") <> Неопределено Тогда 
		Элементы.СписокКонтекстноеМенюРежимПросмотраСписком.Пометка = Ложь;
	КонецЕсли;
	Если Элементы.Найти("СписокКонтекстноеМенюРежимПросмотраПоПапкам") <> Неопределено Тогда 
		Элементы.СписокКонтекстноеМенюРежимПросмотраПоПапкам.Пометка = Ложь;
	КонецЕсли;
	Если Элементы.Найти("СписокКонтекстноеМенюРежимПросмотраПоВидамДокументов") <> Неопределено Тогда 
		Элементы.СписокКонтекстноеМенюРежимПросмотраПоВидамДокументов.Пометка = Ложь;
	КонецЕсли;
	Если Элементы.Найти("СписокКонтекстноеМенюРежимПросмотраПоВопросамДеятельности") <> Неопределено Тогда 
		Элементы.СписокКонтекстноеМенюРежимПросмотраПоВопросамДеятельности.Пометка = Ложь;
	КонецЕсли;
	Если Элементы.Найти("СписокКонтекстноеМенюРежимПросмотраПоКонтрагентам") <> Неопределено Тогда 
		Элементы.СписокКонтекстноеМенюРежимПросмотраПоКонтрагентам.Пометка = Ложь;
	КонецЕсли;
	Если Элементы.Найти("СписокКонтекстноеМенюРежимПросмотраПоНоменклатуреДел") <> Неопределено Тогда 
		Элементы.СписокКонтекстноеМенюРежимПросмотраПоНоменклатуреДел.Пометка = Ложь;
	КонецЕсли;
	Если Элементы.Найти("СписокКонтекстноеМенюРежимПросмотраПоДеламТомам") <> Неопределено Тогда 
		Элементы.СписокКонтекстноеМенюРежимПросмотраПоДеламТомам.Пометка = Ложь;
	КонецЕсли;
	Если Элементы.Найти("СписокКонтекстноеМенюРежимПросмотраПоКатегориям") <> Неопределено Тогда 
		Элементы.РежимПросмотраПоКатегориям.Пометка = Ложь;
	КонецЕсли;	
	Если Элементы.Найти("СписокКонтекстноеМенюРежимПросмотраПоПроектам") <> Неопределено Тогда 
		Элементы.РежимПросмотраПоПроектам.Пометка = Ложь;
	КонецЕсли;	
	
	Если ВидПросмотра = Перечисления.ВидыПросмотраСпискаОбъектов.Списком Тогда
		
		Элементы.СтраницыДеревоРазрезов.Видимость = Ложь;
		Элементы.РежимПросмотраСписком.Пометка = Истина;
		Если Элементы.Найти("СписокКонтекстноеМенюРежимПросмотраСписком") <> Неопределено Тогда 
			Элементы.СписокКонтекстноеМенюРежимПросмотраСписком.Пометка = Истина;
		КонецЕсли;
		
	ИначеЕсли ВидПросмотра = Перечисления.ВидыПросмотраСпискаОбъектов.ПоПапкам Тогда
		
		Если ЗначениеЗаполнено(Форма.Папка) Тогда 
			Форма.Папка = Неопределено;
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
				"Папка");
			ОбщегоНазначенияДокументооборотКлиентСервер.ПоказатьСкрытьКнопкуОчисткиОтбора(Элементы.ОтборПапка, Неопределено);
		КонецЕсли;
		
		Элементы.СтраницаПапки.Видимость = Истина;
		
		Форма.ТекущаяПапка = Элементы.Папки.ТекущаяСтрока;
		Если ЗначениеЗаполнено(Форма.ТекущаяПапка) Тогда 
			Список.Параметры.УстановитьЗначениеПараметра("Папка", Форма.ТекущаяПапка);
		КонецЕсли;	
		
		Элементы.ОтборПапка.Видимость = Ложь;
		Элементы.Папка.Видимость = Ложь;
		Элементы.РежимПросмотраПоПапкам.Пометка = Истина;
		Если Элементы.Найти("СписокКонтекстноеМенюРежимПросмотраПоПапкам") <> Неопределено Тогда 
			Элементы.СписокКонтекстноеМенюРежимПросмотраПоПапкам.Пометка = Истина;
		КонецЕсли;
		
	ИначеЕсли ВидПросмотра = Перечисления.ВидыПросмотраСпискаОбъектов.ПоКатегориям Тогда
		
		Если Форма.ИспользоватьКатегорииДанных Тогда	
			
			Если ЗначениеЗаполнено(Форма.Категория) Тогда 
				Форма.Категория = Неопределено;
				Параметр = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Категория"));
				Параметр.Использование = Ложь;
				ОбщегоНазначенияДокументооборотКлиентСервер.ПоказатьСкрытьКнопкуОчисткиОтбора(Элементы.ОтборКатегория, Неопределено);
			КонецЕсли;
			
			Если Форма.ИмяФормы = "Справочник.ВнутренниеДокументы.Форма.ФормаСпискаСПапками" Тогда 
				КлючОбъекта = "СписокВнутреннихДокументов";
			ИначеЕсли Форма.ИмяФормы = "Справочник.ВходящиеДокументы.Форма.ОбращенияГраждан" Тогда 	
				КлючОбъекта = "СписокОбращенийГраждан";
			ИначеЕсли Форма.ИмяФормы = "Справочник.ВходящиеДокументы.Форма.ФормаСписка" Тогда 	
				КлючОбъекта = "СписокВходящихДокументов";	
			ИначеЕсли Форма.ИмяФормы = "Справочник.ИсходящиеДокументы.Форма.ФормаСписка" Тогда 	
				КлючОбъекта = "СписокИсходящихДокументов";
			КонецЕсли;	
			
			Форма.ВсеКатегорииПредопределенное = Справочники.КатегорииДанных.ВсеКатегории;
			Форма.КатегорииПриОткрытии = 
				ХранилищеНастроекДанныхФорм.Загрузить(КлючОбъекта, "ОткрытыеКатегории");
				
			Форма.ТекущаяКатегорияПриОткрытии = 
				ХранилищеНастроекДанныхФорм.Загрузить(КлючОбъекта, "ТекущаяКатегория");
				
			Форма.ТекущаяКатегория = Форма.ТекущаяКатегорияПриОткрытии;
			
			Форма.ВыбранныеКатегорииПриОткрытии = 
				ХранилищеНастроекДанныхФорм.Загрузить(КлючОбъекта, "ВыбранныеКатегории");
				
			Если Форма.ВыбранныеКатегорииПриОткрытии.Количество() = 1 И
				Форма.ВыбранныеКатегорииПриОткрытии[0].Значение = Форма.ТекущаяКатегория Тогда
				Форма.ВыбранныеКатегорииПриОткрытии.Очистить();
			КонецЕсли;
			
			Форма.ОтборДанных = 
				ХранилищеНастроекДанныхФорм.Загрузить(КлючОбъекта, "ОтборДанных");	
				
			Форма.СУчетомПодкатегорий = 
				ХранилищеНастроекДанныхФорм.Загрузить(КлючОбъекта, "СУчетомПодкатегорий");
				
			Форма.ПоказыватьСписокОтмеченных = 
				ХранилищеНастроекДанныхФорм.Загрузить(КлючОбъекта, "ПоказыватьСписокОтмеченных");
			
			Если Не ЗначениеЗаполнено(Форма.ОтборДанных) Тогда
				Форма.ОтборДанных = "ПоВсем";
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Форма.СУчетомПодкатегорий) Тогда
				Форма.СУчетомПодкатегорий = Истина;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Форма.ПоказыватьСписокОтмеченных) Тогда
				Форма.ПоказыватьСписокОтмеченных = Ложь;
			КонецЕсли;
			Если Форма.ОтборДанных = "ПоВсем" Тогда
				Элементы.ДеревоКатегорийПоказыватьСУчетомОднойИзОтмеченных.Пометка = Ложь;
				Элементы.ДеревоКатегорийПоказыватьСУчетомВсехОтмеченных.Пометка = Истина;
			Иначе
				Элементы.ДеревоКатегорийПоказыватьСУчетомОднойИзОтмеченных.Пометка = Истина;
				Элементы.ДеревоКатегорийПоказыватьСУчетомВсехОтмеченных.Пометка = Ложь;
			КонецЕсли;
			
			Элементы.ДеревоКатегорийПоказыватьСУчетомИерархии.Пометка = Форма.СУчетомПодкатегорий;
			Элементы.ДеревоКатегорийПоказыватьВыбранныеКатегории.Пометка = Форма.ПоказыватьСписокОтмеченных;
			Элементы.ВыбранныеКатегории.Видимость = Форма.ПоказыватьСписокОтмеченных;
		КонецЕсли;
	
		Форма.ПостроитьДеревоКатегорий();
		Элементы.СтраницаКатегории.Видимость = Истина;
		
		Форма.УстановитьПараметрыВыбранныхКатегорий();
		РаботаСКатегориямиДанныхКлиентСервер.УстановитьТекущуюКатегориюВДеревеПоСсылке(
			Элементы.ДеревоКатегорий, Форма.ДеревоКатегорий, Форма.ТекущаяКатегория);
		
		Элементы.ОтборКатегория.Видимость = Ложь;
		Элементы.ЕстьКатегории.Видимость = Ложь;
		Элементы.РежимПросмотраПоКатегориям.Пометка = Истина;
		Если Элементы.Найти("СписокКонтекстноеМенюРежимПросмотраПоКатегориям") <> Неопределено Тогда 
			Элементы.СписокКонтекстноеМенюРежимПросмотраПоКатегориям.Пометка = Истина;
		КонецЕсли;
		
	ИначеЕсли ВидПросмотра = Перечисления.ВидыПросмотраСпискаОбъектов.ПоВидамДокументов Тогда
		
		Если Элементы.Найти("ОтборВидДокумента") <> Неопределено Тогда 
			Если ЗначениеЗаполнено(Форма.ВидДокумента) Тогда 
				Форма.ВидДокумента = Неопределено;
				ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
					"ВидДокумента");
				ОбщегоНазначенияДокументооборотКлиентСервер.ПоказатьСкрытьКнопкуОчисткиОтбора(Элементы.ОтборВидДокумента, Неопределено);
			КонецЕсли;
		КонецЕсли;
		
		Элементы.СтраницаВидыДокументов.Видимость = Истина;
		
		Форма.ТекущийВидДокумента = Элементы.ВидыДокументов.ТекущаяСтрока;
		Если ЗначениеЗаполнено(Форма.ТекущийВидДокумента) Тогда 
			Список.Параметры.УстановитьЗначениеПараметра("ВидДокумента", 
				Форма.ТекущийВидДокумента);
		КонецЕсли;
		
		Если Элементы.Найти("ОтборВидДокумента") <> Неопределено Тогда
			Элементы.ОтборВидДокумента.Видимость = Ложь;
		КонецЕсли;
		
		Элементы.ВидДокумента.Видимость = Ложь;
		Элементы.РежимПросмотраПоВидамДокументов.Пометка = Истина;
		Если Элементы.Найти("СписокКонтекстноеМенюРежимПросмотраПоВидамДокументов") <> Неопределено Тогда 
			Элементы.СписокКонтекстноеМенюРежимПросмотраПоВидамДокументов.Пометка = Истина;
		КонецЕсли;
		
	ИначеЕсли ВидПросмотра = Перечисления.ВидыПросмотраСпискаОбъектов.ПоВопросамДеятельности Тогда
		
		Элементы.СтраницаВопросыДеятельности.Видимость = Истина;
		
		Форма.ТекущийВопросДеятельности = Элементы.ВопросыДеятельности.ТекущаяСтрока;
		Если ЗначениеЗаполнено(Форма.ТекущийВопросДеятельности) Тогда 
			Список.Параметры.УстановитьЗначениеПараметра("ВопросДеятельности", 
				Форма.ТекущийВопросДеятельности);
		КонецЕсли;
		
		Элементы.ВопросДеятельности.Видимость = Ложь;
		Элементы.РежимПросмотраПоВопросамДеятельности.Пометка = Истина;
		Если Элементы.Найти("СписокКонтекстноеМенюРежимПросмотраПоВопросамДеятельности") <> Неопределено Тогда 
			Элементы.СписокКонтекстноеМенюРежимПросмотраПоВопросамДеятельности.Пометка = Истина;
		КонецЕсли;
		
	ИначеЕсли ВидПросмотра = Перечисления.ВидыПросмотраСпискаОбъектов.ПоКонтрагентам Тогда
		
		Элементы.СтраницаКонтрагенты.Видимость = Истина;
		
		Форма.ТекущийКонтрагент = Элементы.Контрагенты.ТекущаяСтрока;
		Если ЗначениеЗаполнено(Форма.ТекущийКонтрагент) Тогда 
			Список.Параметры.УстановитьЗначениеПараметра("Контрагент", 
				Форма.ТекущийКонтрагент);
		КонецЕсли;
		
		Элементы.ОтборКонтрагент.Видимость = Ложь;
		Элементы.РежимПросмотраПоКонтрагентам.Пометка = Истина;
		Если Элементы.Найти("СписокКонтекстноеМенюРежимПросмотраПоКонтрагентам") <> Неопределено Тогда 
			Элементы.СписокКонтекстноеМенюРежимПросмотраПоКонтрагентам.Пометка = Истина;
		КонецЕсли;
		
		Если Элементы.Найти("Контрагент") <> Неопределено Тогда 
			Элементы.Контрагент.Видимость = Ложь;
			
			Если ЗначениеЗаполнено(Форма.Контрагент) Тогда 
				Форма.Контрагент = Неопределено;
				ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
					"Контрагент");
				ОбщегоНазначенияДокументооборотКлиентСервер.ПоказатьСкрытьКнопкуОчисткиОтбора(Элементы.ОтборКонтрагент, Неопределено);
			КонецЕсли;
			
		ИначеЕсли Элементы.Найти("Отправитель") <> Неопределено Тогда 
			Элементы.Отправитель.Видимость = Ложь;
			
			Если ЗначениеЗаполнено(Форма.Отправитель) Тогда 
				Форма.Отправитель = Неопределено;
				ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
					"Отправитель");
				ОбщегоНазначенияДокументооборотКлиентСервер.ПоказатьСкрытьКнопкуОчисткиОтбора(Элементы.ОтборКонтрагент, Неопределено);
			КонецЕсли;
			
		ИначеЕсли Элементы.Найти("Получатели") <> Неопределено Тогда 
			Элементы.Получатели.Видимость = Ложь;
			
			Если ЗначениеЗаполнено(Форма.Получатель) Тогда 
				Форма.Получатель = Неопределено;
				ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
					"Получатель");
				ОбщегоНазначенияДокументооборотКлиентСервер.ПоказатьСкрытьКнопкуОчисткиОтбора(Элементы.ОтборКонтрагент, Неопределено);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ВидПросмотра = Перечисления.ВидыПросмотраСпискаОбъектов.ПоПроектам Тогда
		
		Если ЗначениеЗаполнено(Форма.Проект) Тогда 
			Форма.Проект = Неопределено;
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
				"Проект");
			ОбщегоНазначенияДокументооборотКлиентСервер.ПоказатьСкрытьКнопкуОчисткиОтбора(Элементы.ОтборПроект, Неопределено);
		КонецЕсли;
		
		Элементы.СтраницаПроекты.Видимость = Истина;
		
		Форма.ТекущийПроект = Элементы.Проекты.ТекущаяСтрока;
		Если ЗначениеЗаполнено(Форма.ТекущийПроект) Тогда 
			Список.Параметры.УстановитьЗначениеПараметра("Проект", Форма.ТекущийПроект);
		КонецЕсли;	
		
		Если Элементы.Найти("ОтборПроект") <> Неопределено Тогда 
			Элементы.ОтборПроект.Видимость = Ложь;
		КонецЕсли;	
		
		Элементы.Проект.Видимость = Ложь;
		Элементы.РежимПросмотраПоПроектам.Пометка = Истина;	
		Если Элементы.Найти("СписокКонтекстноеМенюРежимПросмотраПоПроектам") <> Неопределено Тогда 
			Элементы.СписокКонтекстноеМенюРежимПросмотраПоПроектам.Пометка = Истина;
		КонецЕсли;
		
	ИначеЕсли ВидПросмотра = Перечисления.ВидыПросмотраСпискаОбъектов.ПоНоменклатуреДел Тогда	
		
		ЗаполнитьДеревоНоменклатурыДел(Форма);
		Элементы.СтраницаНоменклатураДел.Видимость = Истина;
		
		ТекущаяСтрока = Элементы.СписокНоменклатураДел.ТекущаяСтрока;
		Если ЗначениеЗаполнено(ТекущаяСтрока) Тогда 
			Список.Параметры.УстановитьЗначениеПараметра("НоменклатураДел", ТекущаяСтрока);
		КонецЕсли;
		
		Элементы.НоменклатураДел.Видимость = Ложь;
		Элементы.РежимПросмотраПоНоменклатуреДел.Пометка = Истина;
		Если Элементы.Найти("СписокКонтекстноеМенюРежимПросмотраПоНоменклатуреДел") <> Неопределено Тогда 
			Элементы.СписокКонтекстноеМенюРежимПросмотраПоНоменклатуреДел.Пометка = Истина;
		КонецЕсли;
		
	ИначеЕсли ВидПросмотра = Перечисления.ВидыПросмотраСпискаОбъектов.ПоДеламТомам Тогда
		
		ЗаполнитьДеревоДелТомов(Форма);
		Элементы.СтраницаДелаТома.Видимость = Истина;
		
		ТекущаяСтрока = Элементы.ДелаТома.ТекущаяСтрока;
		Если ЗначениеЗаполнено(ТекущаяСтрока) Тогда 
			Список.Параметры.УстановитьЗначениеПараметра("Дело", ТекущаяСтрока);
		КонецЕсли;	
		
		Элементы.Дело.Видимость = Ложь;
		Элементы.РежимПросмотраПоДеламТомам.Пометка = Истина;
		Если Элементы.Найти("СписокКонтекстноеМенюРежимПросмотраПоДеламТомам") <> Неопределено Тогда 
			Элементы.СписокКонтекстноеМенюРежимПросмотраПоДеламТомам.Пометка = Истина;
		КонецЕсли;
		
	Иначе
		Форма.ВидПросмотра = Перечисления.ВидыПросмотраСпискаОбъектов.Списком;
		ПереключитьВидПросмотра(Форма);
	КонецЕсли;
	
	Если Форма.ИспользоватьКатегорииДанных = Истина 
		И ПредыдущийВидПросмотра = Перечисления.ВидыПросмотраСпискаОбъектов.ПоКатегориям 
		И ВидПросмотра <> Перечисления.ВидыПросмотраСпискаОбъектов.ПоКатегориям Тогда
			РаботаСКатегориямиДанных.ЗаписатьПараметрыДереваКатегорийВСпискахДокументов(
				КлючОбъекта,
				Форма.СписокРаскрытыхКатегорий,
				Форма.ТекущаяКатегория,
				Форма.ВыбранныеКатегории,
				Форма.ОтборДанных,
				Форма.СУчетомПодкатегорий,
				Форма.ПоказыватьСписокОтмеченных);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет дерево номенклатуры дел в списках документов.
//
// Параметры:
//   Форма - УправляемаяФорма - форма, в которой расположен список.
//
Процедура ЗаполнитьДеревоНоменклатурыДел(Форма) Экспорт 
	
	Дерево = Форма.РеквизитФормыВЗначение("НоменклатураДел");
	Дерево.Строки.Очистить();
	
	Делопроизводство.ЗаполнитьДеревоНоменклатурыДел(Дерево, 
		Форма.ГодНоменклатурыДел, 
		Форма.ОрганизацияНоменклатурыДел);
	
	Форма.ЗначениеВРеквизитФормы(Дерево, "НоменклатураДел");
	
КонецПроцедуры	

// Заполняет дерево дел (томов) в списках документов.
//
// Параметры:
//   Форма - УправляемаяФорма - форма, в которой расположен список.
//
Процедура ЗаполнитьДеревоДелТомов(Форма) Экспорт 
	
	Дерево = Форма.РеквизитФормыВЗначение("ДелаТома");
	Дерево.Строки.Очистить();
	
	Делопроизводство.ЗаполнитьДеревоДелТомов(Дерево, 
		Форма.ГодНоменклатурыДел, 
		Форма.ОрганизацияНоменклатурыДел);
	
	Форма.ЗначениеВРеквизитФормы(Дерево, "ДелаТома");
	
КонецПроцедуры	

// Возвращает контрагента, указанного в документе.
//
// Параметры:
//   Документ - СправочникСсылка.ВнутренниеДокументы, 
//				СправочникСсылка.ВходящиеДокументы, 
//				СправочникСсылка.ИсходящиеДокументы - форма, в которой расположен список.
//
// Возвращаемое значение:
//   СправочникСсылка.Контрагенты - контрагент в документе.
//
Функция ПолучитьКонтрагента(Документ) Экспорт 
	
	Если ТипЗнч(Документ) = Тип("СправочникСсылка.ВнутренниеДокументы") Тогда
		ТекущийКонтрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Контрагент");
	ИначеЕсли ТипЗнч(Документ) = Тип("СправочникСсылка.ВходящиеДокументы") Тогда
		ТекущийКонтрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Отправитель");
	ИначеЕсли ТипЗнч(Документ) = Тип("СправочникСсылка.ИсходящиеДокументы") Тогда
		Получатели = Документ.Получатели;
		Если Получатели.Количество() > 0 Тогда 
			ТекущийКонтрагент = Получатели[0].Получатель;
		КонецЕсли;
	КонецЕсли;
		
	Возврат ТекущийКонтрагент;
	
КонецФункции	

// Устанавливает/снимает пометку удаления для переданного массива документов.
//
// Параметры:
//   Документы - Массив - документы, для которых нужно установить пометку.
//   Пометка - Булево - устанавливаемая пометка.
//
Процедура УстановитьДокументамПометкуУдаленияСервер(Документы, Пометка) Экспорт 
	
	Для каждого Документ Из Документы Цикл
		Права = ДокументооборотПраваДоступа.ПолучитьПраваПоОбъекту(Документ);
		Если Не Права.Удаление Тогда
			СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'У вас нет прав на установку пометки удаления документа ""%1"".'; en = 'No rights to install mark delete document ""%1"".'"),
				Строка(Документ));
			ВызватьИсключение СообщениеОбОшибке;
		КонецЕсли;
	КонецЦикла;	
		
	Для каждого Документ Из Документы Цикл	
		ЗаблокироватьДанныеДляРедактирования(Документ);
		ДокументОбъект = Документ.ПолучитьОбъект();
		ДокументОбъект.УстановитьПометкуУдаления(Пометка);
		РазблокироватьДанныеДляРедактирования(Документ);
	КонецЦикла;
	
КонецПроцедуры
